[
	{
		"name": "Обработка html",
		"body": "gulp-file-include 2.3.0 Подключает в index.html данные из директории /data, через шаблон из директории /html/chunk/news-item.html<br>gulp-htmlmin 5.0.1 Минифицирует html <br>gulp-rename 2.0.0 Добавит к минифицированной версии суффикс min"
	},
	{
		"name": "Обработка css (не подключена в сборку)",
		"body": "gulp-concat 2.6.1 Объединит css-файлы в один<br>gulp-cssimport 7.0.0 Заменит все импорты css на их содержимое<br>gulp-autoprefixer 8.0.0 Для старых браузеров добавит свойства с вендорными префиксами<br>gulp-csso 4.0.1 Минифицирует css файл<br>gulp-rename 2.0.0 добавит к минифицированной версии суффикс min<br>gulp-group-css-media-queries 1.2.2 группирует медиавыражения"
	},
	{
		"name": "Обработка scss",
		"body": "gulp-sass 6.0.0, компилиятор sass 1.77.8 (старая версия) Поскольку синтаксис подключения файлов sass через @import перестал работать, нужно писать либо новый синтаксис, либо подключать мигратор, либо понизить версию sass до 1.77.8<br>gulp-sass-glob 1.1.0 Импортирует файлы через маски<br>Итоговый скомпилированный файл css буден также иметь минифицированную версию с суффиксом min"
	},
	{
		"name": "Обработка js",
		"body": "gulp-babel 8.0.0; @babel/core 7.26.7; @babel/preset-env 7.26.7 Преобразует современный JS в совместимый с более старыми версиями <br>webpack 5.97.1, webpack-stream7.0.0 Для сборки подключаемых модулей в один файл<br>gulp-uglify 3.0.2 минифицирует файл"
	},
	{
		"name": "Работа с изображениями",
		"body": "gulp-imagemin 7.1.0 Ужимает картинки. <br>gulp-newer 1.4.0 Обрабатывает только новые картинки <br>gulp-webp 4.0. Создаёт к каждой картинке версию webp <br>gulp-webp-html 1.0.2; gulp-webp-css 1.1.0 Webp могут не поддерживать старые браузеры. Надежнее использовать тег picture: если браузер поддерживает, то даст webp, если нет то будет привычный формат. ЧТобы не писать вручную, плагины допишут тег picture в разметку и стили автоматически.<br>gulp-webp-css 1.1.0"
	},
	{
		"name": "Подготовка шрифтов",
		"body": "gulp-fonter 0.3.0; gulp-ttf2woff2 4.0.1 Конвертируют шрифты в woff, woff2"
	}
]